WB/src/Catalogs/РазмерыКарточекТоваров/РазмерыКарточекТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РазмерыКарточекТоваров</name>
  <owners>Catalog.КарточкиТоваров</owners>
  <attributes>
    <name>Ид</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазмерРФ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Баркоды</name>
    <attributes>
      <name>Баркод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

WB/src/Catalogs/РазмерыКарточекТоваров/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ОбновитьИлиСоздать(ДанныеAPI, КарточкаТовара) Экспорт
	
	Объект = Неопределено;
	Ссылка = НайтиПоРеквизиту("Ид", ДанныеAPI.Ид, , КарточкаТовара);
	
	Если Ссылка = Неопределено ИЛИ Ссылка.Пустая() Тогда
		Объект = СоздатьЭлемент();
		Объект.Владелец = КарточкаТовара;
	Иначе
		Объект = Ссылка.ПолучитьОбъект();
	КонецЕсли;
	
	ЗаполнитьИзДанныхAPI(Объект, ДанныеAPI);
	
	Объект.Записать();
	Возврат Объект.Ссылка;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьИзДанныхAPI(Объект, ДанныеAPI)
	
	Объект.Наименование = ДанныеAPI.Размер + " (" + ДанныеAPI.РазмерРФ + ")";
	Объект.Ид = ДанныеAPI.Ид;
	Объект.Размер = ДанныеAPI.Размер;
	Объект.РазмерРФ = ДанныеAPI.РазмерРФ;
	
	БаркодыAPI = Неопределено;
	Если ДанныеAPI.Свойство("Баркоды", БаркодыAPI) Тогда
		Объект.Баркоды.Очистить();
		Для Каждого ЭлементAPI Из БаркодыAPI Цикл
			Стр = Объект.Баркоды.Добавить();
			Стр.Баркод = ЭлементAPI;
		КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
